'use client'

import React from 'react'

export default function AboutPage (): React.JSX.Element {
  return (
    <>
      <div id='About'>
        <h1>安眠ラインを探せ！！！</h1>
        <p className='mt-3'>
          <span><strong>“眠れぬほど、株を持つな。”</strong></span> ーーアメリカの5大財閥の1つであるモルガン財閥の創始者、J.P.モルガンの言葉です。
          <br />
          <br />
          保有している株式の価格変動が気になって眠れない、そんな経験はありませんか？
          <br />
          眠れない程ではないにしても、夜中にふと目が覚めてしまい、スマホで株価をチェックしてしまうこともあるでしょう。
          <br />
          <br />
          そのような状態であるならば、それは投資比率が高すぎる可能性があります。
          <br />
          <br />
          投資は長期的な視点で行うべきものであり、短期的な価格変動に一喜一憂していては、精神的にも疲弊してしまいます。
          <br />
          <br />
          まずは、自分にとっての安眠ライン（眠れる投資比率）を見つけることが重要です。
          <br />
          <br />
          例えば、100万円の資産があり、全額を投資に回している場合を考えましょう。
          <br />
          もし資産が半減した場合、50万円の損失となり、資産全体の50%を失うことになります。
          <br />
          これは多くの人にとって非常にストレスフルな状況です。
          <br />
          <br />
          一方で、投資比率を30%に下げた場合、同じく資産が半減しても15万円の損失にとどまり、資産全体の15%の損失となります。
          <br />
          これにより、精神的な負担が大幅に軽減され、安眠を保つことができるでしょう。
          <br />
          <br />
          この安眠できるポイントは人それぞれ異なります。
          <br />
          あなたの資産状況やリスク許容度に応じて、最適な投資比率を見つけることが大切です。
          <br />
          <br />
          このアプリケーションでは、あなたの資産状況やリスク許容度に基づいて、最適な投資比率を計算し、安眠ラインを見つけるお手伝いをします。
        </p>
      </div>
    </>
  )
}
