'use client'

import React from 'react'

export default function AboutPage (): React.JSX.Element {
  return (
    <>
      <div id='About'>
        <h1>安眠ラインを探せ！！！</h1>
        <p className='mt-3'>
          <span><strong>“眠れぬほど、株を持つな。”</strong></span> ーーアメリカの5大財閥の1つであるモルガン財閥の創始者、J.P.モルガンの言葉です。
          <br />
          <br />
          保有している株式の価格変動が気になって眠れない、そんな経験はありませんか？
          <br />
          眠れない程ではないにしても、夜中にふと目が覚めてしまい、スマホで株価をチェックしてしまうこともあるでしょう。
          <br />
          <br />
          そのような状態であるならば、それは投資比率が高すぎる可能性があります。
          <br />
          投資は長期的な視点で行うべきものであり、短期的な価格変動に一喜一憂していては、精神的にも疲弊してしまいます。
          <br />
          まずは、自分にとっての安眠ライン（眠れる投資比率）を見つけることが重要です。
          <br />
          例えば、100万円の資産があり、そのうち20万円を投資に回している場合、投資比率は20%です。
          <br />
          ...
        </p>
      </div>
    </>
  )
}
